ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_uart.c
/***************************************************************************//**
* \file cy_scb_uart.c
* \version 1.0
*
* Provides UART API implementation of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif

/* Static functions */
static void HandleDataReceive (CySCB_Type *base, cy_stc_scb_uart_context_t *context);
static void HandleRingBuffer  (CySCB_Type *base, cy_stc_scb_uart_context_t *context);
static void HandleDataTransmit(CySCB_Type *base, cy_stc_scb_uart_context_t *context);


/*******************************************************************************
* Function Name: Cy_SCB_UART_Init
****************************************************************************//**
*
* Initializes the SCB for UART operation.
*
* \param base
* The pointer to the UART SCB instance.
*
* \param config
* The pointer to configuration structure \ref cy_stc_scb_uart_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_uart_context_t allocated
* by the user. The structure is used during the UART operation for internal
* configuration and data keeping. The user should not modify anything
* in this structure.
* If only UART functions which do not require context will be used pass NULL
* as pointer to context.
*
* \return
* \ref cy_en_scb_uart_status_t
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
*******************************************************************************/
cy_en_scb_uart_status_t Cy_SCB_UART_Init(CySCB_Type *base, cy_stc_scb_uart_config_t const *config, cy_stc_scb_uart_context_t *context)
{
    cy_en_scb_uart_status_t retStatus = CY_SCB_UART_BAD_PARAM;

    if ((NULL != base) && (NULL != config))
    {
        uint32_t ovs;

        if ((CY_SCB_UART_IRDA == config->uartMode) && (!config->irdaEnableLowPowerReceiver))
        {
            /* For Normal IrDA mode oversampling is always zero */
            ovs = 0UL;
        }
        else
        {
            ovs = (config->oversample - 1UL);
        }

        /* Configure the UART interface */
        base->CTRL = (config->enableMutliProcessorMode      ? SCB_CTRL_ADDR_ACCEPT_Msk : 0UL) |
                        ((config->dataWidth <= CY_SCB_BYTE_WIDTH) ? SCB_CTRL_BYTE_MODE_Msk : 0UL)   |
                        _VAL2FLD(SCB_CTRL_OVS, ovs)                                              |
                        _VAL2FLD(SCB_CTRL_MODE, CY_SCB_CTRL_MODE_UART);

        base->UART_CTRL = _VAL2FLD(SCB_UART_CTRL_MODE, config->uartMode);

        /* Configure the RX direction */
        base->UART_RX_CTRL = (config->irdaInvertRx     ? SCB_UART_RX_CTRL_POLARITY_Msk : 0UL)               |
                                (config->enableMutliProcessorMode  ? SCB_UART_RX_CTRL_MP_MODE_Msk : 0UL)       |
                                (config->dropOnParityError  ? SCB_UART_RX_CTRL_DROP_ON_PARITY_ERROR_Msk : 0UL) |
                                (config->dropOnFrameError   ? SCB_UART_RX_CTRL_DROP_ON_FRAME_ERROR_Msk : 0UL)  |
                                _VAL2FLD(SCB_UART_RX_CTRL_BREAK_WIDTH, (config->breakWidth - 1UL))             |
                                _VAL2FLD(SCB_UART_RX_CTRL_STOP_BITS,   (config->stopBits - 1UL))               |
                                _VAL2FLD(CY_SCB_UART_RX_CTRL_SET_PARITY,   config->parity);

        base->RX_CTRL = (config->enableMsbFirst    ? SCB_RX_CTRL_MSB_FIRST_Msk : 0UL) |
                           (config->enableInputFilter ? SCB_RX_CTRL_MEDIAN_Msk : 0UL)    |
                            _VAL2FLD(SCB_RX_CTRL_DATA_WIDTH, (config->dataWidth - 1UL));

        base->RX_MATCH = _VAL2FLD(SCB_RX_MATCH_ADDR, config->receiverAddress) |
                            _VAL2FLD(SCB_RX_MATCH_MASK, config->receiverAddressMask);

        /* Configure the TX direction */
        base->UART_TX_CTRL = (config->smartCardRetryOnNack ? SCB_UART_TX_CTRL_RETRY_ON_NACK_Msk : 0UL) |
                                _VAL2FLD(SCB_UART_TX_CTRL_STOP_BITS, (config->stopBits - 1UL))            |
                                _VAL2FLD(CY_SCB_UART_RX_CTRL_SET_PARITY, config->parity);

        base->TX_CTRL  = (config->enableMsbFirst ? SCB_RX_CTRL_MSB_FIRST_Msk : 0UL) |
                            _VAL2FLD(SCB_TX_CTRL_DATA_WIDTH, (config->dataWidth - 1UL));

        base->RX_FIFO_CTRL = _VAL2FLD(SCB_RX_FIFO_CTRL_TRIGGER_LEVEL, config->rxFifoTriggerLevel);

        /* Configure the flow control */
        base->UART_FLOW_CTRL = (config->enableCts ? SCB_UART_FLOW_CTRL_CTS_ENABLED_Msk : 0UL)                      |
                          ((CY_SCB_UART_ACTIVE_HIGH == config->ctsPolarity) ? SCB_UART_FLOW_CTRL_CTS_POLARITY_Msk : 0UL) |
                          ((CY_SCB_UART_ACTIVE_HIGH == config->rtsPolarity) ? SCB_UART_FLOW_CTRL_RTS_POLARITY_Msk : 0UL) |
                           _VAL2FLD(SCB_UART_FLOW_CTRL_TRIGGER_LEVEL, config->rtsRxFifoLevel);


        base->TX_FIFO_CTRL = _VAL2FLD(SCB_TX_FIFO_CTRL_TRIGGER_LEVEL, config->txFifoTriggerLevel);

        /* Set up interrupt sources */
        base->INTR_TX_MASK = config->txFifoIntEnableMask;
        base->INTR_RX_MASK = config->rxFifoIntEnableMask;

        /* Initialize context */
        if (NULL != context)
        {
            context->rxStatus  = 0UL;
            context->txStatus  = 0UL;

            context->rxRingBuf = NULL;
            context->rxRingBufSize = 0UL;

            context->rxBufIdx  = 0UL;
            context->txLeftToTransmit = 0UL;

            context->cbEvents = NULL;

        #if !defined(NDEBUG)
            /* Put an initialization key into the initKey variable to verify
            * context initialization in the transfer API.
            */
            context->initKey = CY_SCB_UART_INIT_KEY;
        #endif /* !(NDEBUG) */
        }

        retStatus = CY_SCB_UART_SUCCESS;
    }

    return (retStatus);
}


